# ==========================================
# โจทย์ข้อที่ 4: คำนวณค่าจอดรถ
# Input: จำนวนชั่วโมงที่จอด (จำนวนเต็ม)
# Output: ค่าจอดรถ (0, 20 หรือ 50)
# เงื่อนไข: ไม่เกิน 1 ชั่วโมง จ่าย 0 | 2-4 ชั่วโมง จ่าย 20 | เกิน 4 ชั่วโมง จ่าย 50
# ==========================================

# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
hour = int(input("จำนวนชั่วโมงที่จอด: "))

if hour < = 1 ชั่วโมง
    print("0")
elif hour = 2 ถึง 4 ชั่วโมง
    print("20")
elif hour > = 4 ชั่วโมง
    print("50")
else:
    print("50")
